SET NAMES UTF8;
DROP DATABASE IF EXISTS hs;
CREATE DATABASE hs CHARSET=UTF8;
USE hs;

/**用户信息表**/
CREATE TABLE hs_user(
  uid INT PRIMARY KEY AUTO_INCREMENT,
  uname VARCHAR(32),
  upwd VARCHAR(32));

  /* 插入四个用户 */
INSERT INTO hs_user VALUES
(NULL, 'woshiyihao', '123456'),
(NULL, 'woshierhao', '123456'),
(NULL, 'doudou', '666666'),
(NULL, 'yaya', '888888');


/* 产品表 */
DROP TABLE IF EXISTS hs_products;
CREATE TABLE hs_products(
  pid INT PRIMARY KEY AUTO_INCREMENT,
  category_id INT,            #所属分类编号
  title VARCHAR(128),         #标题/名称
  price DECIMAL(10,2),        #价格
  detail VARCHAR(128),       #描述、详情
  category VARCHAR(32),       #所属分类
  sold_count INT,             #已售出的数量
  is_onsale BOOLEAN,           #是否促销中
  shelf_time DATETIME        #上架时间
);

/* 插入产品 */
INSERT INTO hs_products VALUES
(NULL, 001,'英国富尔顿/FULTON&Cath Kidston联名系列 五折伞 F13-24 London Christmas',320.00,'Fulton与Cath Kidston的联名设计，冬日星空、巴士、伦敦塔的钟声，把伦敦圣诞节以一种更鲜活、梦幻的方式呈现，通篇蓝色华丽点缀各种减龄，全新的透明防晒涂层，UPF50+，能阻隔阳光中伤害皮肤的不可见光。除了伞套，还附赠配套同色系小肩包非常实用，让你美美哒出门，满满的童趣随身携带。','生活',55,true,now()),
(NULL, 003,'喧哗-意大利保温杯/黑色',288.00,'?---“喧哗”不仅代表了不同语言共存与冲突的状态，也象征着当代社会文化的多元与非固定性特征： 众多各自独立而不相融合的声音与意识，他们有机地交错在一起，彼此平等地相互讨论、争辩所构筑成的景观。 优质不锈钢运动保温杯，瓶盖含防漏硅胶封条，12小时保温，24小时保冷。','厨房',99,true,now()),
(NULL, 003,'《愿望》红酒杯',577.00,'手工描金红酒杯','厨房',21,true,now()),
(NULL, 002,'“永恒的流动：扎哈·哈迪德x跨界”—ZAHA HADID作品全集 1967-2016',280.00,'在《扎哈·哈迪德作品全集 1967-2016》书中，处处可见她在思考每一件建筑物時，始終优先考虑周遭环境。本书中完整纪录她生平所有的创作，包含145件建筑设计，以及超过60件家具、灯饰、精品。实际制作时，惊觉它不是一本用普通编辑流程能轻易完成的书，內容涉及构成主义、拓撲学，這些藏于话题之外，丰富她真实设计的灵感来源，也涉及到現代主义和数学相关的系普、脉络和技术。','书籍',04,false,now()),
(NULL, 002,'至上主义立体书',25999.00,'“扎哈·哈迪德主义”文件2010 +展览策划和设计的哈迪德在gmurzynska画廊在苏黎世，这对俄罗斯构成主义先锋者的工作和影响。特别版套装包括展览目录，一个手工制作的立体弹出和证书的真实性，都包含在一个特制的刻着黑色和白色的有机玻璃展示盒。该集可作为编号。','书籍',02,false,now()),
(NULL, 004,'瓷盘 ▪ 蝶恋花',168.00,'彩蝶轻俯丛中桃花浅，此系列的配色以及图案以中国词牌蝶恋花的意韵为灵感，让现代妩媚的东方美感显得更为时尚而自信。以色彩的变化演绎蝶恋花，经典的撞色设计，让人感受到浓郁的中国风，同时利落的线条和裁剪则凸显了现代感，中西元素的完美运用成为设计的亮点所在。 瓷质细腻通透，器形美观典雅，彩面润泽光亮，画面多姿多彩。','儿童产品',32,true,now()),
(NULL, 005,'手机壳-克林姆特系列《吻》',128.00,'《吻》（THE KISS)可能是Klimt作品中最受欢迎，且 最直白的表达对于性爱的赞歌。这部作品也常常在后人的创作中被效仿。和《阿黛尔1号》一样，该作品是Klimt黄金时期的重要组成部分，曾被后人看做新艺术作品的代表案例。这幅作品展现了Klimt在利用大量极端素材时的组合能力，尽管整体构图较为简单。产品采用进口钢化玻璃以及TPU软边包裹，手感细腻，舒适有度，适用于iPhone7/8/7P/8P/X。','艺术',132,true,now()),
(NULL, 005,'《盒子玫瑰》',20000.00,'《玫瑰象征爱情。而铅既柔软又沉重；既可塑又易损毁；既沉静又绚丽；既稳定又具毒性，虽是金属却很脆弱。用铅的材料属性和玫瑰的自然造型结合描述爱情，观点应该是明确的。爱情和其它事物一样，其真实面貌并非与自己看到的和想象的一致，犹如这绽放的铅玫瑰，品者自知。','艺术',13,true,now()),
(NULL, 005,'富士立拍立得相纸方形10张',128.00,'复古而精炼，时尚又新颖，方形构图一直是摄影爱好者的创意之选，方形相纸更延伸了一次成像的表现力和应用性。','艺术',56,true,now());

//创建购物项表
CREATE TABLE hs_cartItem(
  iid INT PRIMARY KEY AUTO_INCREMENT,
  uid INT,
  pid INT,
  count INT);
//插入购物项
INSERT INTO hs_cartItem VALUES
(NULL,11,5,9),
(NULL,1,11,2),
(NULL,8,2,3),
(NULL,10,4,1),
(NULL,2,4,2),
(NULL,3,3,3),
(NULL,1,5,1),
(NULL,6,6,1),
(NULL,2,6,3),
(NULL,4,8,1),
(NULL,5,9,4),
(NULL,9,1,1),
(NULL,10,10,7),
(NULL,12,7,4),
(NULL,4,11,4),
(NULL,5,8,9),
(NULL,2,2,9);
